package pro.sky.AnimalShelter.messages;
/**
 * Перечисление, константных строк бота.
 */
public class MessagesBot {
    public static final String ADOPT_COMMAND_DOG = "В этом меню я расскажу вам как взять животное из приюта для собак. Какую информацию вы бы хотели получить?\n" +
            "1. Правила знакомства с животным (/dating_rules)\n" +
            "2. Список необходимых документов (/documents)\n" +
            "3. Рекомендации по транспортировке животного (/transportation_recommendation)\n" +
            "4. Рекомендации по обустройству дома для щенка (/puppy_home_setup_recommendation)\n" +
            "5. Рекомендации по обустройству дома для взрослого животного (/home_setup_recommendations)\n" +
            "6. Рекомендации по обустройству дома для животного с ограниченными возможностями (/special_need_recommendation)\n" +
            "7. Советы кинолога (/dog_trainer_advice)\n" +
            "8. Рекомендации по проверенным кинологам (/verified_dog_handlers)\n" +
            "9. Причины, почему могут отказать и не дать забрать собаку из приюта (/refusal_reason)\n" +
            "10. Оставить контактные данные (/contact)\n" +
            "11. Позвать волонтера (/help)\n" +
            "12. Назад (/back)\n" +
            "13. Выключить бота (/stop)";

    public static final String ADOPT_COMMAND_CAT ="В этом меню я расскажу вам как взять животное из приюта для кошек. Какую информацию вы бы хотели получить?\n" +
            "1. Правила знакомства с животным (/dating_rules)\n" +
            "2. Список необходимых документов (/documents)\n" +
            "3. Рекомендации по транспортировке животного (/transportation_recommendation)\n" +
            "4. Рекомендации по обустройству дома для котёнка (/kitty_home_setup_recommendation)\n" +
            "5. Рекомендации по обустройству дома для взрослого животного (/home_setup_recommendations)\n" +
            "6. Рекомендации по обустройству дома для животного с ограниченными возможностями (/special_need_recommendation)\n" +
            "7. Оставить контактные данные (/contact)\n" +
            "8. Позвать волонтера (/help)\n" +
            "9. Назад (/back)\n" +
            "10. Выключить бота (/stop)";

}




