package pro.sky.AnimalShelter.messages;

/**
 * Перечисление, константных строк бота.
 */
public class MessagesBot {
    public static final String adoptCommandDog = "В этом меню я расскажу вам как взять животное из приюта для собак. Какую информацию вы бы хотели получить?\n" +
            "1. Правила знакомства с животным (/dating_rules)\n" +
            "2. Список необходимых документов (/documents)\n" +
            "3. Рекомендации по транспортировке животного (/transportation_recommendation)\n" +
            "4. Рекомендации по обустройству дома для щенка (/puppy_home_setup_recommendation)\n" +
            "5. Рекомендации по обустройству дома для взрослого животного (/home_setup_recommendations)\n" +
            "6. Рекомендации по обустройству дома для животного с ограниченными возможностями (/special_need_recommendation)\n" +
            "7. Советы кинолога (/dog_trainer_advice)\n" +
            "8. Рекомендации по проверенным кинологам (/verified_dog_handlers)\n" +
            "9. Причины, почему могут отказать и не дать забрать собаку из приюта (/refusal_reason)\n" +
            "10. Оставить контактные данные (/contact)\n" +
            "11. Позвать волонтера (/help)\n" +
            "12. Назад (/back)\n" +
            "13. Выключить бота (/stop)";

    public static final String adoptCommandCat = "В этом меню я расскажу вам как взять животное из приюта для кошек. Какую информацию вы бы хотели получить?\n" +
            "1. Правила знакомства с животным (/dating_rules)\n" +
            "2. Список необходимых документов (/documents)\n" +
            "3. Рекомендации по транспортировке животного (/transportation_recommendation)\n" +
            "4. Рекомендации по обустройству дома для котёнка (/kitty_home_setup_recommendation)\n" +
            "5. Рекомендации по обустройству дома для взрослого животного (/home_setup_recommendations)\n" +
            "6. Рекомендации по обустройству дома для животного с ограниченными возможностями (/special_need_recommendation)\n" +
            "7. Оставить контактные данные (/contact)\n" +
            "8. Позвать волонтера (/help)\n" +
            "9. Назад (/back)\n" +
            "10. Выключить бота (/stop)";

    public static final String datingRulesHandlerDog = "      В этом разделе я расскажу Вам правила знакомства с собакой. \n" +
            "             \n" +
            "  Не смотрите собаке прямо в глаза (это для них признак агрессии) - смотрите на хвост, на уши, на холку.\n " +
            "Вообще, из приюта та собака доставит вам меньше проблем, которая уже при первой встрече захочет с вами гулять, играть, гладить, пусть даже вначале немного испугается. " +
            "Если вы по незнанию допустите какую-то ошибку и собака начнет на вас лаять, а вам захочется взять именно ее. " +
            "То чтобы помириться, встаньте в ней боком и смотрите в другую сторону, не на собаку.\n" +
            "Итак, не смотреть в глаза, не класть руку прямо на спину, не трепать по шее, холке, не гладить живот (гладить в первый раз незнакомую собаку можно только по боку). " +
            "Когда будете надевать ошейник или поводок, или начнете гладить, не наклоняйтесь над собакой сверху, а присаживайтесь на корточки.\n" +
            "Потом, когда собака станет вашей и привыкнет к вам, она уже не боится и ей можно смотреть в глаза, трепать по холке, чесать пузо. Я говорю о мерах \"собачьей вежливости\" при первом знакомстве.\n" +
            "             \n" +
            "Возврат в предыдущее меню (/back)\n" +
            "Выключить бота (/stop)";
    public static final String datingRulesHandlerCat = "В этом разделе я расскажу Вам правила знакомства с кошкой. \n" +
            "  Как бы удивительно это ни звучало, но многие допускают массу ошибок, когда начинают гладить кошек. Правильно это делать надо так:\n" +
            " 1.Кошка должна вас видеть полностью, не подходите сзади и не наклоняйтесь сверху.\n " +
            " 2.Дайте кошке обнюхать вас и услышать, какие на вас запахи. Можно протянуть ей какую-то свою вещь для большего контакта. Постарайтесь сделать так, чтобы от вас не пахло другими животными.\n " +
            " 3.Опуститесь на один уровень с животным.\n " +
            " 4.Медленно и плавно протяните руку к животному.\n " +
            " 5.Дайте кошке выбор: если она подойдет к вам — значит вы получили разрешение погладить ее, если нет — то пока стоит повременить с ласками.\n " +
            " 6.Если кошка дала свое согласие, начните гладить ее медленно по шее, голове и спине. Не пытайтесь погладить живот и хвост, пока она сама не разрешит вам это сделать.\n " +
            "             \n" +
            "Возврат в предыдущее меню (/back)\n" +
            "Выключить бота (/stop)";

    public static final String documentsListHandler = "В этом меню я расскажу какие документы нужны, чтобы взять животное из приюта.\n" +
            "             \n" +
            "  Чтобы забрать животное из приюта, необходимо при себе необходимо иметь копию паспорта и справку с места жительства.\n" +
            " Приют пристраивает только обработанных от паразитов, вакцинированных и стерилизованных животных.\n" +
            "\n" +
            "После передачи животного администрация приюта просит новых владельцев раз в месяц отправлять фотоотчёты о жизни бывшего подопечного.";

}




